<?php
if (!defined('DATALIFEENGINE') || !defined('LOGGED_IN')) {
    die('Hacking attempt!');
}
?>


<div class="panel-body">
    <h2>
    	UNITE Gallery - модуль генерации галереи картинок из допполей (Плагин для DLE 13 и выше)
    </h2>
	<p>
		Данный модуль подключает в шаблон сайта JS плагин <a href="https://unitegallery.net/index.php?page=documentation" target="_blank">unitegallery <i class="fa fa-external-link"></i></a>. <br>
		Исходный код JS плагина на <a href="https://github.com/vvvmax/unitegallery/" target="_blank">github.com <i class="fa fa-external-link"></i></a>
	</p>
	<h3>Обзор Unite Gallery</h3>
	<p>
		<b>Unite Gallery</b> - это многоцелевая галерея javascript, основанная на библиотеке jquery. Он построен с модульной техникой с акцентом на простоту использования и настройки. Очень легко настроить галерею, изменить ее скин с помощью CSS и даже написать собственную тему. Тем не менее, эта галерея очень мощная, быстрая и имеет большинство современных функций, таких как отзывчивость, сенсорное управление и даже функция масштабирования, это уникальный эффект.
	</p>

	<img src="http://online.tcse-cms.com/plugins/unitegallery/image_1.jpg" style="max-width: 100%">

	<h3>Особенности</h3>
	<p><b>Галерея воспроизводит ВИДЕО</b> с: Youtube, Vimeo, HTML5, Wistia и SoundCloud (не видео, но все же)</p>
	<p><b>Отзывчивый</b> - подходит для каждого экрана с автоматическим сохранением соотношения</p>
	<p><b>Touch Enabled</b> - каждая часть галереи может управляться сенсорными устройствами с сенсорным экраном</p>
	<p><b>Отзывчивый</b> - галерея может соответствовать размеру экрана и реагировать на изменение размера экрана.</p>
	<p><b>Skinnable</b> - Позволяет легко менять скин в другом файле CSS, не касаясь основной галереи CSS.
	<p><b>Themable</b> - галерея имеет различные темы, каждая тема имеет свои собственные параметры и функции, но она использует основные объекты галереи</p>
	<p><b>Эффект масштабирования</b> - галерея имеет уникальный эффект масштабирования, который можно применить с помощью кнопок, колесика мыши или жеста повышения на устройствах с сенсорным экраном</p>
	<p><b>Кнопки галереи</b> - в галерее есть кнопки, такие как полноэкранный режим или воспроизведение / пауза, оптимизированные для доступа сенсорных устройств</p>
	<p><b>Управление с клавиатуры</b> - Галерея может управляться с клавиатуры (стрелки влево, вправо)
	Тонны вариантов. Галерея имеет огромное количество опций для каждого объекта галереи, которые делают процесс настройки простым и увлекательным.</p>
	<p><b>Мощный API</b> - с помощью API галереи вы можете интегрировать галерею в поведение вашего сайта и использовать ее с другими элементами, такими как лайтбоксы и так далее</p>
	
	<p>
		Официальная страница плагина для DLE <a href="hhttps://tcse-cms.com/works/1320-unite-gallery-by-tcse.html" target="_blank"><b>https://tcse-cms.com/</b> <i class="fa fa-external-link"></i></a>
	</p>



</div>
