<?php
if (!defined('DATALIFEENGINE') || !defined('LOGGED_IN')) {
    die('Hacking attempt!');
}
?>


<div class="panel-body">
    <h2>
    	UNITE Gallery - модуль генерации галереи картинок из допполей (Плагин для DLE 13 и выше)
    </h2>
	<p>
		Данный модуль подключает в шаблон сайта JS плагин <a href="https://unitegallery.net/index.php?page=documentation" target="_blank">unitegallery <i class="fa fa-external-link"></i></a>. <br>
		Исходный код JS плагина на <a href="https://github.com/vvvmax/unitegallery/" target="_blank">github.com <i class="fa fa-external-link"></i></a>
	</p>
	<h5>Обзор Unite Gallery</h5>
	<p>
		Unite Gallery - это многоцелевая галерея javascript, основанная на библиотеке jquery. Он построен с модульной техникой с акцентом на простоту использования и настройки. Очень легко настроить галерею, изменить ее скин с помощью CSS и даже написать собственную тему. Тем не менее, эта галерея очень мощная, быстрая и имеет большинство современных функций, таких как отзывчивость, сенсорное управление и даже функция масштабирования, это уникальный эффект.
	</p>

	<img src="http://online.tcse-cms.com/plugins/unitegallery/image_1.jpg" style="max-width: 100%">

	<h5>Особенности</h5>
	<p>Галерея воспроизводит ВИДЕО с: Youtube, Vimeo, HTML5, Wistia и SoundCloud (не видео, но все же)</p>
	<p>Отзывчивый - подходит для каждого экрана с автоматическим сохранением соотношения</p>
	<p>Touch Enabled - каждая часть галереи может управляться сенсорными устройствами с сенсорным экраном</p>
	<p>Отзывчивый - галерея может соответствовать размеру экрана и реагировать на изменение размера экрана.</p>
	<p>Skinnable - Позволяет легко менять скин в другом файле CSS, не касаясь основной галереи CSS.
	<p>Themable - галерея имеет различные темы, каждая тема имеет свои собственные параметры и функции, но она использует основные объекты галереи</p>
	<p>Эффект масштабирования - галерея имеет уникальный эффект масштабирования, который можно применить с помощью кнопок, колесика мыши или жеста повышения на устройствах с сенсорным экраном</p>
	<p>Кнопки галереи - в галерее есть кнопки, такие как полноэкранный режим или воспроизведение / пауза, оптимизированные для доступа сенсорных устройств</p>
	<p>Управление с клавиатуры - Галерея может управляться с клавиатуры (стрелки влево, вправо)
	Тонны вариантов. Галерея имеет огромное количество опций для каждого объекта галереи, которые делают процесс настройки простым и увлекательным.</p>
	<p>Мощный API - с помощью API галереи вы можете интегрировать галерею в поведение вашего сайта и использовать ее с другими элементами, такими как лайтбоксы и так далее</p>
	
	<p>
		Официальная страница плагина для DLE <a href="https://tcse-cms.com/works/" target="_blank"><b>https://tcse-cms.com/</b></a>
	</p>



</div>
